module.exports =
    
    EMPTY    : 0
    MUSHROOM : 1
    ROCK     : 2

    resource_costs: [
        [   0,   0,    0 ] # empty
        [  +5,  +5, +100 ]]# mushroom
    
    action_costs:
        rest: [+25, +25, -1] # Отдыхаем
        eat:  [  0,  -1, -1] # Едим

        grab: [ 0, -1, -1] # подбираем грибочек
        drop: [ 0, -1, -1] # борсаем грибочек
        
        n:    [ 0, -1, -1] # идем на север
        e:    [ 0, -1, -1] # ....... восток
        s:    [ 0, -1, -1] # ....... юг
        w:    [ 0, -1, -1] # ....... запад

        dig:  [ 0, -2, -2] # копаем слуайное ближайшее место
        dn:   [ 0, -2, -2] # копаем на север
        dе:   [ 0, -2, -2] # ......... восток
        ds:   [ 0, -2, -2] # ......... юг
        dw:   [ 0, -2, -2] # ......... запад

        fight:[ 0, -2, -2] # атакуем ближайшего гнома из другого клана
        fn:   [ 0, -2, -2] # атакуем на север
        fw:   [ 0, -2, -2] # .......... восток
        fe:   [ 0, -2, -2] # .......... юг
        fs:   [ 0, -2, -2] # .......... запад

